# ============================================
# Taps
# ============================================

tap "homebrew/bundle"
tap "antoniorodr/memo"                                   # @guest
tap "steipete/tap"                                       # @guest
tap "yakitrak/yakitrak"                                  # @guest

# ============================================
# CLI Tools
# ============================================

# Remove large files or passwords from Git history
brew "bfg"                                               # @personal @guest
# Dependency manager for Cocoa projects
brew "cocoapods"                                         # @personal @guest
# Manage macOS Dock items from the command line
brew "dockutil"                                          # @personal @guest
# Fast and simple Node.js version manager
brew "fnm"                                               # @personal @guest
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"                                        # @personal @guest
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language for simple/reliable/efficient software
brew "go"                                                # @personal @guest
# CLI email client written in Rust
brew "himalaya"                                          # @guest
# Lightweight and flexible command-line JSON processor
brew "jq"
# Create and manage Apple Silicon-native virtual machines
brew "lume"                                              # @host @guest
# Non-interactive SSH password authentication
brew "sshpass"                                           # @host
# Mac App Store command-line interface
brew "mas"                                               # @personal
# Remote terminal application
brew "mosh"
# Media player based on MPlayer and mplayer2
brew "mpv"                                               # @personal
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"                                           # @personal @guest
# General-purpose speech recognition model
brew "openai-whisper"                                    # @personal
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"                                         # @personal @guest
# Swiss-army knife of markup format conversion
brew "pandoc"                                            # @personal @guest
# SSL tunneling program
brew "stunnel"                                           # @personal @guest
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"                                          # @personal @guest

# ============================================
# Steipete Tools
# ============================================

# Fast X CLI for tweeting, replying, and reading
brew "steipete/tap/bird"                                 # @guest
# Grep the GIF
brew "steipete/tap/gifgrep"                              # @guest
# Google CLI for Gmail, Calendar, Drive, and Contacts
brew "steipete/tap/gogcli"                               # @guest
# Google Places API CLI
brew "steipete/tap/goplaces"                             # @guest
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"                                 # @guest
# macOS screenshots and AI vision analysis
brew "steipete/tap/peekaboo"                             # @guest
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"                            # @guest
# Link to clean text to summary
brew "steipete/tap/summarize"                            # @guest
# WhatsApp CLI built on whatsmeow
brew "steipete/tap/wacli"                                # @guest

# ============================================
# Third-Party CLI
# ============================================

# CLI app to manage Apple Notes and Apple Reminders
brew "memo"                                              # @guest
# Obsidian CLI
brew "yakitrak/yakitrak/obsidian-cli"                    # @guest

# ============================================
# Fonts
# ============================================

# Nerd Font required by Powerlevel10k
cask "font-meslo-lg-nerd-font"

# ============================================
# Applications (Casks)
# ============================================

# Security
# Password manager
cask "1password"                                         # @personal @guest
# 1Password command-line tool
cask "1password-cli"                                     # @personal @guest

# Development
# Write, edit, and chat about your code with AI
cask "cursor"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"                                          # @personal @guest

# AI Tools
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar for Claude/Codex usage monitoring
cask "claudebar"                                         # @personal
# OpenAI's coding agent that runs in your terminal
cask "codex"

# Browsers
# Web browser
cask "google-chrome"                                     # @personal @guest
# Firefox-based browser
cask "zen"                                               # @personal @guest

# Productivity
# Screen color temperature controller
cask "flux-app"                                          # @personal
# Microsoft Office alternative
cask "libreoffice"                                       # @personal
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"                                          # @personal
# Control your tools with a few keystrokes
cask "raycast"                                           # @personal @guest
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"                                         # @personal @guest
# Speech to text
cask "superwhisper"                                      # @personal @host

# Communication
# Voice and text chat software
cask "discord"                                           # @personal
# Team communication and collaboration software
cask "slack"                                             # @personal
# Messaging app with a focus on speed and security
cask "telegram"                                          # @personal @guest
# Video communication and virtual meeting platform
cask "zoom"                                              # @personal

# Media
# E-books management software
cask "calibre"                                           # @personal
# Open-source software for live streaming and screen recording
cask "obs"                                               # @personal
# Music streaming service
cask "spotify"                                           # @personal
# Multimedia player
cask "vlc"                                               # @personal

# Utilities
# Open-source keystroke visualiser
cask "keycastr"                                          # @personal
# Mesh VPN
cask "tailscale-app"                                     # @personal @guest
# Rust-based terminal
cask "warp"                                              # @personal @guest

# ============================================
# Mac App Store
# ============================================

# Screen time limiter
mas "Jomo - Screen Time Blocker", id: 1609960918        # @personal
