# ============================================
# Taps
# ============================================

tap "homebrew/bundle"
tap "antoniorodr/memo"
tap "steipete/tap"
tap "yakitrak/yakitrak"

# ============================================
# CLI Tools
# ============================================

# Remove large files or passwords from Git history
brew "bfg"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Fast and simple Node.js version manager
brew "fnm"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language for simple/reliable/efficient software
brew "go"
# CLI email client written in Rust
brew "himalaya"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Create and manage Apple Silicon-native virtual machines
brew "lume"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# General-purpose speech recognition model
brew "openai-whisper"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# SSL tunneling program
brew "stunnel"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"

# ============================================
# Steipete Tools
# ============================================

# Fast X CLI for tweeting, replying, and reading
brew "steipete/tap/bird"
# Grep the GIF
brew "steipete/tap/gifgrep"
# Google CLI for Gmail, Calendar, Drive, and Contacts
brew "steipete/tap/gogcli"
# Google Places API CLI
brew "steipete/tap/goplaces"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# macOS screenshots and AI vision analysis
brew "steipete/tap/peekaboo"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# Link to clean text to summary
brew "steipete/tap/summarize"
# WhatsApp CLI built on whatsmeow
brew "steipete/tap/wacli"

# ============================================
# Third-Party CLI
# ============================================

# CLI app to manage Apple Notes and Apple Reminders
brew "memo"
# Obsidian CLI
brew "yakitrak/yakitrak/obsidian-cli"

# ============================================
# Fonts
# ============================================

# Nerd Font required by Powerlevel10k
cask "font-meslo-lg-nerd-font"

# ============================================
# Applications (Casks)
# ============================================

# Security
# Password manager
cask "1password"
# 1Password command-line tool
cask "1password-cli"

# Development
# Tools for building Android applications
cask "android-studio"
# Write, edit, and chat about your code with AI
cask "cursor"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"

# AI Tools
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar for Claude/Codex usage monitoring
cask "claudebar"
# OpenAI's coding agent that runs in your terminal
cask "codex"

# Browsers
# Web browser
cask "google-chrome"
# Firefox-based browser
cask "zen"

# Productivity
# Block websites, games and applications
cask "cold-turkey-blocker"
# Screen color temperature controller
cask "flux-app"
# Microsoft Office alternative
cask "libreoffice"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Speech to text
cask "superwhisper"

# Communication
# Voice and text chat software
cask "discord"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Video communication and virtual meeting platform
cask "zoom"

# Media
# E-books management software
cask "calibre"
# Open-source software for live streaming and screen recording
cask "obs"
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"

# Utilities
# Open-source keystroke visualiser
cask "keycastr"
# Virtual machines UI using QEMU
cask "utm"
# Mesh VPN
cask "tailscale-app"
# Rust-based terminal
cask "warp"

# ============================================
# VS Code / Cursor Extensions
# ============================================

vscode "anthropic.claude-code"
vscode "openai.chatgpt"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"

# ============================================
# Mac App Store
# ============================================

# Screen time limiter
mas "Jomo - Screen Time Blocker", id: 1609960918
