# ============================================
# Taps
# ============================================

tap "homebrew/bundle"

# ============================================
# CLI Tools
# ============================================

# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# SSL tunneling program
brew "stunnel"
# Simplified and community-driven man pages
brew "tldr"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"

# ============================================
# Fonts
# ============================================

# Nerd Font required by Powerlevel10k
cask "font-meslo-lg-nerd-font"

# ============================================
# Applications (Casks)
# ============================================

# Development
# Tools for building Android applications
cask "android-studio"
# Write, edit, and chat about your code with AI
cask "cursor"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"

# AI Tools
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar for Claude/Codex usage monitoring
cask "claudebar"
# OpenAI's coding agent that runs in your terminal
cask "codex"

# Browsers
# Web browser
cask "google-chrome"
# Firefox-based browser
cask "zen"

# Productivity
# Block websites, games and applications
cask "cold-turkey-blocker"
# Screen color temperature controller
cask "flux-app"
# Microsoft Office alternative
cask "libreoffice"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Speech to text
cask "superwhisper"

# Communication
# Voice and text chat software
cask "discord"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Video communication and virtual meeting platform
cask "zoom"

# Media
# E-books management software
cask "calibre"
# Open-source software for live streaming and screen recording
cask "obs"
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"

# Utilities
# Open-source keystroke visualiser
cask "keycastr"
# Virtual machines UI using QEMU
cask "utm"
# Rust-based terminal
cask "warp"

# ============================================
# VS Code / Cursor Extensions
# ============================================

vscode "anthropic.claude-code"
vscode "openai.chatgpt"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"

# ============================================
# Mac App Store
# ============================================

# Screen time limiter
mas "Jomo - Screen Time Blocker", id: 1609960918
